app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hello, Rails"], ["body", "I am on Rails!!!!!!!"], ["status", "public"], ["created_at", "2022-03-04 14:00:54.383410"], ["updated_at", "2022-03-04 14:00:54.383410"]]