app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "comments" ("commenter", "body", "status", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "aline"], ["body", "fsdsfffsdf"], ["status", "public"], ["article_id", 2], ["created_at", "2022-03-04 11:38:22.646046"], ["updated_at", "2022-03-04 11:38:22.646046"]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)